{
  "dark_mode": "KARANLIK MOD",
  "light_mode": "AYDINLIK MOD",
  "hire_me": "Beni işe alın",
  "skills": "Beceriler",
  "projects": "Projeler",
  "catchword": "Yaratıcı düşünür Minimalizm aşığı",
  "information": "Merhaba, ben Yiğitcan. Eğer sağlam ve ölçeklenebilir frontend ürünleriyle harika kullanıcı deneyimleri oluşturan bir Developer arıyorsanız, Benimle el sıkışın.",
  "html_skill": "HTML ile web geliştirme konusunda deneyimliyim. HTML, web sayfalarının yapısal bileşenlerini oluşturmak için kullandığım temel bir işaret dilidir. Ayrıca CSS ile birlikte kullanarak web sayfalarının görünümünü özelleştirebiliyorum. HTML5'i kullanarak modern web standardına uygun olarak zengin içerik sunabiliyorum. Ayrıca doğru HTML semantiği kullanarak web sayfalarının erişilebilirliğini ve SEO performansını artırıyorum.",
  "css_skill": "Web geliştirme konusunda CSS becerilerimle deneyimliyim. CSS, Cascading Style Sheets'in kısaltmasıdır ve web sayfalarının görünümünü özelleştirmek için kullanılır. Renkler, fontlar, arka planlar, düzenler ve animasyonlar gibi birçok stil özelliğini kontrol etmek için CSS kullanabilirim. Web sitelerinin görsel çekiciliğini artırmak, kullanıcı deneyimini iyileştirmek ve marka kimliğini yansıtmak için CSS'i etkili bir şekilde kullanabilirim.",
  "javascript_skill": "Web geliştirme konusunda JavaScript becerilerimle deneyimliyim. JavaScript, web sayfalarına etkileşim ve dinamizm kazandıran bir programlama dilidir. Kullanıcıların butonlara tıklama, formları doldurma gibi etkileşimlerini yönetebilir, verileri işleyebilir ve web sayfalarını canlandırabilirim. Ajax çağrıları, veri doğrulama, kullanıcı deneyimi iyileştirmeleri gibi birçok işlevi JavaScript ile gerçekleştirebilirim. JavaScript'i kullanarak web sitelerini daha interaktif, kullanıcı dostu ve işlevsel hale getirebilirim.",
  "react_skill": "React konusunda deneyimli bir web geliştiriciyim. React, kullanıcı arayüzü oluşturmak için kullanılan popüler bir JavaScript kütüphanesidir. Component tabanlı yapısıyla modüler ve yeniden kullanılabilir bileşenler oluşturmayı sağlar. Virtual DOM'unu kullanarak performansı optimize eder ve verimli bir şekilde güncellemeleri yönetir. React'i kullanarak modern ve etkileyici kullanıcı arayüzleri geliştirebilir, bileşenler arasında veri akışını yönetebilir ve dinamik web uygulamaları oluşturabilirim.",
  "redux_skill": "Redux'u kullanarak veri yönetimi konusunda deneyimliyim. Redux, React uygulamalarında kullanılan bir durum yönetim kütüphanesidir. Tek bir merkezi depoda uygulama durumunu saklayarak, bileşenler arasında veri akışını yönetmek ve tutarlılığı sağlamak için kullanılır. Redux, eylemler, reducer'lar ve mağazalar aracılığıyla veri akışını yönetir. Büyük ve karmaşık uygulamalarda bile durumu kolayca yönetebilir ve uygulama performansını optimize edebiliriz.",
  "nodejs_skill": "Node.js konusunda deneyimli bir web geliştiriciyim. Node.js, sunucu tarafı JavaScript çalıştırmak için kullanılan bir çalışma zamanı ortamıdır. Verimli ve olaya dayalı bir mimariye sahiptir, böylece yoğun ağ tabanlı uygulamaları hızlı ve ölçeklenebilir bir şekilde geliştirebiliriz. Node.js, paket yöneticisi npm ile geniş bir ekosisteme sahiptir ve Express.js gibi popüler bir çerçeve ile web uygulamaları oluşturmayı kolaylaştırır. Veritabanı entegrasyonu, API geliştirme ve gerçek zamanlı uygulamalar gibi birçok alanda Node.js'i etkili bir şekilde kullanabilirim.",
  "about_me_p1": "Merhaba! Ben bir Full Stack Web Geliştiriciyim ve tutkum olan web uygulamaları oluşturma konusunda heyecanlıyım. Kariyerim ve eğitim geçmişim, bilgi ve becerilerimi geliştirmek için Workintech eğitim kurumundaki yoğun eğitim programıyla tamamlandı. Workintech eğitim programı, 900 saatten fazla süren ve endüstri standartlarına uygun beceriler kazanmamı sağlayan bir deneyimdi. Bu süre zarfında, gerçek dünya projelerinde aktif olarak yer aldım ve sürekli olarak kendimi geliştirme fırsatı buldum. Kullanıcı odaklı deneyimler yaratma hedefimle birlikte, yazılım geliştirme alanına olan merakım ve tutkum birleşti. Ayrıntılara olan dikkatim ve görsel estetiğe verdiğim önem sayesinde, sezgisel ve etkileyici web uygulamaları oluşturmak için gereken becerileri edindim. JavaScript, React.js ve Node.js gibi teknolojilerde uzmanlaşarak dinamik ve etkileşimli web siteleri geliştirme yeteneği kazandım. ",
  "about_me_p2": "Sürekli olarak endüstri trendleriyle adım adım ilerlemek ve kendimi güncel tutmak için çaba sarf ediyorum. Yaratıcılığım, teknik uzmanlığım ve sürekli öğrenme tutkum, kalıcı etkiler bırakan yüksek kaliteli çözümler sunma konusundaki taahhüdümü destekliyor. Profesyonel bir şekilde çalışmaktan ve aynı vizyona sahip diğer uzmanlarla işbirliği yapmaktan büyük keyif alıyorum. Her zaman yeni zorluklarla karşılaşmayı ve projelerde büyümeyi sabırsızlıkla bekliyorum. Web geliştirme alanında uzmanlaşmış bir ekiple çalışmanızı sağlayarak projenizi birlikte hayata geçirmek için buradayım. Eğer bir web projesi geliştirmek veya işbirliği yapmak konusunda ilgileniyorsanız, lütfen benimle iletişime geçmekten çekinmeyin. Sizin için en iyi çözümleri sunmaktan mutluluk duyarım.",
  "profile": "Profil",
  "about_me_tag": "Hakkımda",
  "date_of_birth": "Doğum tarihi",
  "city_of_residence": "İkamet Şehri",
  "education": "Eğitim Durumu",
  "preferred_job_role": "Tercih Ettiği Rol",
  "project_calculator": "Redux Calculator",
  "Calculator": "Redux Hesap Makinesi",
  "Calculator_info": "Redux kullanılarak oluşturulmuş bir hesap makinesi projesi. Bu proje, kullanıcının matematiksel işlemler yapabilmesini ve sonuçları görüntüleyebilmesini sağlayan bir arayüz sunuyor. Redux'un veri deposu ve state yönetimi özellikleri sayesinde, kullanıcı girdileri tutulabiliyor ve uygulama durumu kolaylıkla yönetilebiliyor. Kullanıcı tarafından yapılan her işlem, Redux üzerinden alınıyor, işleniyor ve sonuç ekranda gösteriliyor.",
  "Grateful_Diary": "Minnet Günlüğü",
  "Grateful_Diary_info": "Minnet Günlüğü'ne hoş geldiniz, günlük minnettarlık pratiğine katılmanızı teşvik eden dönüştürücü bir web uygulaması. Sürekli dikkat dağıtıcı ve stres faktörleriyle dolu bir dünyada, Minnet Günlüğü size yansıma, takdir ve kişisel gelişim için bir sığınak sunar.",
  "Movie_app": "Film Uygulaması",
  "Movie_app_info": "Film dünyasına hızlı bir yolculuğa çıkın! Filmleri listeliyor, beğenilerinize göre puanlayabiliyor, kendi yorumlarınızı yazabiliyor ve favori listesine ekleyebiliyorsunuz. Heyecan verici özellikleriyle size sinematik deneyimde yeni bir soluk getiren bu uygulama, film tutkunları için vazgeçilmez bir yol gösterici haline geliyor.",
  "slogan": "Hadi bir sonraki projenizde beraber çalışalım.",
  "Recipe_search_app_description": "Bu projede, Edamam Recipe Search API'nın gücünü ve Tailwind CSS'nin esnekliğini bir araya getirerek, kullanıcıların geniş bir yelpazede lezzetli tarifler keşfetmelerini sağladım. Bu proje, API entegrasyonu yapabilme, görsel olarak çekici arayüzler tasarlama ve sorunsuz bir kullanıcı deneyimi sunma becerilerimi sergiliyor."
}
