{
  "dark_mode": "KARANLIK MOD",
  "light_mode": "AYDINLIK MOD",
  "hire_me": "Beni işe alın",
  "skills": "Beceriler",
  "projects": "Projeler",
  "catchword": "Yaratıcı düşünür Minimalizm aşığı",
  "information": "Merhaba, ben Yiğitcan. Eğer sağlam ve ölçeklenebilir frontend ürünleriyle harika kullanıcı deneyimleri oluşturan bir Developer arıyorsanız, Benimle el sıkışın.",
  "html_skill": "HTML ile web geliştirme konusunda deneyimliyim. HTML, web sayfalarının yapısal bileşenlerini oluşturmak için kullandığım temel bir işaret dilidir. Ayrıca CSS ile birlikte kullanarak web sayfalarının görünümünü özelleştirebiliyorum. HTML5'i kullanarak modern web standardına uygun olarak zengin içerik sunabiliyorum. Ayrıca doğru HTML semantiği kullanarak web sayfalarının erişilebilirliğini ve SEO performansını artırıyorum.",
  "css_skill": "Web geliştirme konusunda CSS becerilerimle deneyimliyim. CSS, Cascading Style Sheets'in kısaltmasıdır ve web sayfalarının görünümünü özelleştirmek için kullanılır. Renkler, fontlar, arka planlar, düzenler ve animasyonlar gibi birçok stil özelliğini kontrol etmek için CSS kullanabilirim. Web sitelerinin görsel çekiciliğini artırmak, kullanıcı deneyimini iyileştirmek ve marka kimliğini yansıtmak için CSS'i etkili bir şekilde kullanabilirim.",
  "javascript_skill": "Web geliştirme konusunda JavaScript becerilerimle deneyimliyim. JavaScript, web sayfalarına etkileşim ve dinamizm kazandıran bir programlama dilidir. Kullanıcıların butonlara tıklama, formları doldurma gibi etkileşimlerini yönetebilir, verileri işleyebilir ve web sayfalarını canlandırabilirim. Ajax çağrıları, veri doğrulama, kullanıcı deneyimi iyileştirmeleri gibi birçok işlevi JavaScript ile gerçekleştirebilirim. JavaScript'i kullanarak web sitelerini daha interaktif, kullanıcı dostu ve işlevsel hale getirebilirim.",
  "react_skill": "React konusunda deneyimli bir web geliştiriciyim. React, kullanıcı arayüzü oluşturmak için kullanılan popüler bir JavaScript kütüphanesidir. Component tabanlı yapısıyla modüler ve yeniden kullanılabilir bileşenler oluşturmayı sağlar. Virtual DOM'unu kullanarak performansı optimize eder ve verimli bir şekilde güncellemeleri yönetir. React'i kullanarak modern ve etkileyici kullanıcı arayüzleri geliştirebilir, bileşenler arasında veri akışını yönetebilir ve dinamik web uygulamaları oluşturabilirim.",
  "redux_skill": "Redux'u kullanarak veri yönetimi konusunda deneyimliyim. Redux, React uygulamalarında kullanılan bir durum yönetim kütüphanesidir. Tek bir merkezi depoda uygulama durumunu saklayarak, bileşenler arasında veri akışını yönetmek ve tutarlılığı sağlamak için kullanılır. Redux, eylemler, reducer'lar ve mağazalar aracılığıyla veri akışını yönetir. Büyük ve karmaşık uygulamalarda bile durumu kolayca yönetebilir ve uygulama performansını optimize edebiliriz.",
  "nodejs_skill": "Node.js konusunda deneyimli bir web geliştiriciyim. Node.js, sunucu tarafı JavaScript çalıştırmak için kullanılan bir çalışma zamanı ortamıdır. Verimli ve olaya dayalı bir mimariye sahiptir, böylece yoğun ağ tabanlı uygulamaları hızlı ve ölçeklenebilir bir şekilde geliştirebiliriz. Node.js, paket yöneticisi npm ile geniş bir ekosisteme sahiptir ve Express.js gibi popüler bir çerçeve ile web uygulamaları oluşturmayı kolaylaştırır. Veritabanı entegrasyonu, API geliştirme ve gerçek zamanlı uygulamalar gibi birçok alanda Node.js'i etkili bir şekilde kullanabilirim."
}
