{
  "dark_mode": "DARK MODE",
  "light_mode": "LIGHT MODE",
  "hire_me": "Hire me",
  "skills": "Skills",
  "projects": "Projects",
  "catchword": "Creative thinker Minimalism lover",
  "information": "Hi, I’m Yiğitcan. If you are looking for a Developer who to craft solid and scalable frontend products with great user experiences. Let’s shake hands with me.",
  "html_skill": "I am experienced in web development with HTML. HTML is a fundamental markup language used to create the structural components of web pages. Additionally, I can customize the appearance of web pages by using CSS in conjunction with HTML. I am capable of delivering rich content in accordance with modern web standards using HTML5. Moreover, I enhance the accessibility and SEO performance of web pages by employing proper HTML semantics.",
  "css_skill": "I am experienced in web development with CSS. CSS, which stands for Cascading Style Sheets, is used to customize the appearance of web pages. I can control various style properties such as colors, fonts, backgrounds, layouts, and animations using CSS. I can effectively utilize CSS to enhance the visual appeal of websites, improve user experience, and reflect brand identity.",
  "javascript_skill": "I am experienced in web development with JavaScript. JavaScript is a programming language that adds interactivity and dynamism to web pages. I can manage user interactions like button clicks and form submissions, process data, and bring web pages to life using JavaScript. I can perform various tasks with JavaScript, such as Ajax calls, data validation, and enhancing user experience. By using JavaScript, I can make websites more interactive, user-friendly, and functional.",
  "react_skill": "I am an experienced web developer in React. React is a popular JavaScript library used for building user interfaces. It allows creating modular and reusable components with its component-based architecture. By utilizing its virtual DOM, React optimizes performance and efficiently manages updates. With React, I can develop modern and impressive user interfaces, manage data flow between components, and build dynamic web applications.",
  "redux_skill": "I have expertise in data management with Redux. Redux is a state management library used in React applications. It maintains application state in a single centralized store, ensuring data flow consistency and management between components. Through actions, reducers, and stores, Redux handles data flow. I can easily manage state in large and complex applications and optimize application performance.",
  "nodejs_skill": "I am a skilled web developer in Node.js. Node.js is a runtime environment used to execute server-side JavaScript. It has an efficient and event-driven architecture, allowing fast and scalable development of network-intensive applications. With Node.js, I can leverage its extensive ecosystem, including the npm package manager, and utilize popular frameworks like Express.js to simplify web application development. I can effectively use Node.js in various areas such as database integration, API development, and real-time applications."
}
